---
title: OpenOptions
classe: Autodesk.Revit.DB.OpenOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# OpenOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean AllowOpeningLocalByWrongUser { get; set; }` | `openOptions.AllowOpeningLocalByWrongUser` | Boolean |
| `Boolean Audit { get; set; }` | `openOptions.Audit` | Boolean |
| `DetachFromCentralOption DetachFromCentralOption { get; set; }` | `openOptions.DetachFromCentralOption` | DetachFromCentralOption |
| `Boolean IgnoreExtensibleStorageSchemaConflict { get; set; }` | `openOptions.IgnoreExtensibleStorageSchemaConflict` | Boolean |
| `Boolean IsValidObject { get; }` | `openOptions.IsValidObject` | Boolean |
| `OpenForeignOption OpenForeignOption { get; set; }` | `openOptions.OpenForeignOption` | OpenForeignOption |
| `Void Dispose()` | `openOptions.Dispose()` | Void |
| `WorksetConfiguration GetOpenWorksetsConfiguration()` | `openOptions.GetOpenWorksetsConfiguration()` | WorksetConfiguration |
| `Void SetOpenWorksetsConfiguration(WorksetConfiguration)` | `openOptions.SetOpenWorksetsConfiguration(openConfiguration)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```